# Task 2 alisonhatfield_2.ipynb

1. See the text Ch 7.14.2.
2. For more complex data, we can use a DataFrame. In a DataFrame, each value is a Series of numbers.
3. We can use a two-dimensional DataFrame to handle many  exam scores for each key/student.
4. Create a new notebook to practice using DataFrames. Use File / Save As to name the notebook yourname_2.ipynb.
5. Use your Markdown skills to add a customized title section to your notebook. 
6. Use Markdown heading for each section below (with Python cells in between).


Changing example code to make sense with my domain of basektball, but doing the same steps.

## Task 1

1. Follow the instructions in 7.14.2 to import pandas as pd and create a pandas DataFrame from a dictionary (a set of key-value pairs) holding multiple exam scores for each key/student. In this example, we have 5 students, each with 3 exam scores, but the scores aren't labeled.

In [29]:
import pandas as pd

points_dict = {'Brooke' : [15, 12, 20], 'Gracie' : [10, 8, 11], 'Lou': [2, 8, 6], 'Olivia': [2, 0, 6], 'Jen': [20, 14, 16]}

points = pd.DataFrame(points_dict)

points

   Brooke  Gracie  Lou  Olivia  Jen
0      15      10    2       2   20
1      12       8    8       0   14
2      20      11    6       6   16

## Task 2. Custom Index

1. Follow the instructions to apply a custom index (instead of 0,1,2), let's call them 'Test1', Test2', and 'Test3'. See 'Customizing a DataFrame's Indices with the index Attribute subsection. 
2. As we did in Part 1, we can request grades by key using the text attribute (square brackets with single quoted text strings). Find Eva's grades with grades['Eva'] 
3. If no spaces in the key, we can use the simpler dot attribute approach. Find Sam's grades with grades.Sam as shown in 'Accessing a DataFrame's columns' subsection.

In [30]:
points.index = ['Game1', 'Game2', 'Game3']

points

       Brooke  Gracie  Lou  Olivia  Jen
Game1      15      10    2       2   20
Game2      12       8    8       0   14
Game3      20      11    6       6   16

In [31]:
points['Gracie']

Game1    10
Game2     8
Game3    11
Name: Gracie, dtype: int64

In [32]:
points.Lou

Game1    2
Game2    8
Game3    6
Name: Lou, dtype: int64

## Task 3. Accessing Rows (loc, iloc)

1. Like spreadsheets, we can access specific rows or columns.
2. We use loc['ColA'] and iloc[i]  to access rows by name and index, respectively.
3. Execute the examples using loc['Test1'] to get scores for the first exam, or iLoc[0] to get scores for the first exam and iLoc[1] to get scores for the second exam. Which do you prefer? 
4. We can also get slices of rows, e.g., from ['Test1':'Test3'], inclusive, or, using index values, from [0:2], inclusive.

In [33]:
points.loc['Game1']

Brooke    15
Gracie    10
Lou        2
Olivia     2
Jen       20
Name: Game1, dtype: int64

In [34]:
points.iloc[0]

Brooke    15
Gracie    10
Lou        2
Olivia     2
Jen       20
Name: Game1, dtype: int64

For this scenaro, I think I like the points.loc['Game1'] method better. It it more straight forward sicne we named the Indexes to game 1, game 2, game 3, ect.

In [35]:
points.loc['Game1' : 'Game2']

       Brooke  Gracie  Lou  Olivia  Jen
Game1      15      10    2       2   20
Game2      12       8    8       0   14

In [36]:
points.iloc[0:2]

       Brooke  Gracie  Lou  Olivia  Jen
Game1      15      10    2       2   20
Game2      12       8    8       0   14

## Task 3. Accessing Subsets (at, iat)

1. We can use similar notation to get a single cell in the DataFrame (much like getting a single cell in a spreadsheet). 
2. Use grades.at['Test2', 'Eva'} to find her score on the second exam using labels.
3. Use grades.iat[2,0] to get the score on the third exam for the first student (Wally), using indices.

In [37]:
#points for Gracie in 2nd game.
points.at['Game2', 'Gracie']

8

In [38]:
# Points for Brooke in 3rd game.
points.iat[2,0]

20

## Task 4. Describe (By Column)

1. Use grades.describe() to get descriptive statistics for our gradebook columns.
2. See why learning Python and DataFrames can be so powerful?  
3. Try to set the precision using the pd.set_option('precision',2) provided.
4. Does it work? Libraries are evolving. If you get an error, copy the error text and do a web search.
5. Can you find something about a newer option using "display.precision"?
6. If so, try pd.set_option("display.precision",2).
7. Being able to debug evolving features on your own is important for success.
8. Our field, languages, and libraries are constantly evolving.

In [39]:
points.describe()

       Brooke  Gracie   Lou  Olivia    Jen
count    3.00    3.00  3.00    3.00   3.00
mean    15.67    9.67  5.33    2.67  16.67
std      4.04    1.53  3.06    3.06   3.06
min     12.00    8.00  2.00    0.00  14.00
25%     13.50    9.00  4.00    1.00  15.00
50%     15.00   10.00  6.00    2.00  16.00
75%     17.50   10.50  7.00    4.00  18.00
max     20.00   11.00  8.00    6.00  20.00

In [40]:
pd.set_option("display.precision", 2)

points. describe()

       Brooke  Gracie   Lou  Olivia    Jen
count    3.00    3.00  3.00    3.00   3.00
mean    15.67    9.67  5.33    2.67  16.67
std      4.04    1.53  3.06    3.06   3.06
min     12.00    8.00  2.00    0.00  14.00
25%     13.50    9.00  4.00    1.00  15.00
50%     15.00   10.00  6.00    2.00  16.00
75%     17.50   10.50  7.00    4.00  18.00
max     20.00   11.00  8.00    6.00  20.00

## Task 5. Transpose (rows <--> columns)

1. Get the average for each column by calling grades.mean()
2. Transpose the DataFrame using the T attribute.
3. Get the mean by the new columns with .T.describe()

In [41]:
points.mean()

Brooke    15.67
Gracie     9.67
Lou        5.33
Olivia     2.67
Jen       16.67
dtype: float64

In [42]:
points.T

        Game1  Game2  Game3
Brooke     15     12     20
Gracie     10      8     11
Lou         2      8      6
Olivia      2      0      6
Jen        20     14     16

In [43]:
points.T.describe()

       Game1  Game2  Game3
count   5.00   5.00   5.00
mean    9.80   8.40  11.80
std     7.95   5.37   6.18
min     2.00   0.00   6.00
25%     2.00   8.00   6.00
50%    10.00   8.00  11.00
75%    15.00  12.00  16.00
max    20.00  14.00  20.00

## Task 6. Sort 

1. Sort the gradebook rows in reverse order so the most recent exam row appears at the top with grades.sort_index(ascending=False)
2. Sort the gradebook columns so the names appear in order using grades.sort_index(axis=1).
3. We can sort our data pretty much however we like.

In [44]:
points.sort_index(ascending=False)

       Brooke  Gracie  Lou  Olivia  Jen
Game3      20      11    6       6   16
Game2      12       8    8       0   14
Game1      15      10    2       2   20

In [45]:
points.sort_index(axis=1)

       Brooke  Gracie  Jen  Lou  Olivia
Game1      15      10   20    2       2
Game2      12       8   14    8       0
Game3      20      11   16    6       6